emacs/modes/go-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>go-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">go-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc0778bf">1. 概述</a></li>
<li><a href="#orgbbecea5">2. 安装</a></li>
<li><a href="#org94d1c16">3. 配置</a></li>
<li><a href="#org7dc67c3">4. 其他扩展</a>
<ul>
<li><a href="#orga855af3">4.1. Gopls</a></li>
<li><a href="#orgae54d69">4.2. 语法/错误检查</a></li>
<li><a href="#orgd00eec1">4.3. 自动补全</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc0778bf" class="outline-2">
<h2 id="orgc0778bf"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/dominikh/go-mode.el">go-mode</a> 是 emacs 用来编辑 golang 的 major mode。
</p>

<p>
除了常规功能(如字体和缩进)外，该模式还与常见的 Emacs 功能紧密集成(例如，基于语法的导航 <code>begining-of-defun</code> )，go-mode 还具有以下额外功能来改善体验：
</p>
<ul class="org-ul">
<li>集成 gofmt，提供相同名称的命令，以及 <code>gofmt-before-save</code> ，可通过 hook 在保存 go buffer 之前对 buffer 中的代码进行格式化。
<ul class="org-ul">
<li><code>gofmt-command</code> 变量可设置使用 <code>goimports</code> 。</li>
<li><code>gofmt-args</code> 变量可设置以支持 <code>gofmt -s</code> 命令。</li>
</ul></li>
<li>集成 godoc，提供命令 <code>godoc</code> 和 <code>godoc-at-point</code> 。</li>
<li>集成 Playgroud
<ul class="org-ul">
<li>go-play-buffer 和 go-play-region 将代码发送到 Playground.</li>
<li>go-download-play 将 Playground 条目下载到新 buffer 中.</li>
</ul></li>
<li>管理 imports
<ul class="org-ul">
<li>跳转到文件导入， <code>go-goto-imports (C-c C-f i)</code></li>
<li>添加导入，包括制表符补全， <code>go-import-add (C-c C-a)</code></li>
<li>删除或注释未使用的 imports， <code>go-remove-unused-imports</code></li>
<li>建议使用 goimports 或 gopls 的 organize-imports 功能来自动管理添加/删除/组织 import。</li>
</ul></li>

<li>集成 godef
<ul class="org-ul">
<li><code>godef-describe(C-c C-d)</code> 描述表达式</li>
<li><code>godef-jump(C-c C-j)</code> 和 <code>godef-jump-other-window(C-x 4 C-c C-j)</code> 跳转到声明。</li>
<li>这需要通过 <code>go get github.com/rogpeppe/godef</code> 安装 godef。</li>
<li>建议使用 gopls 提供的功能支持。</li>
</ul></li>

<li>对 imenu 的基本支持(函数和变量)</li>
<li><code>go-coverage</code> 支持显示通过 <code>go test</code> 计算的代码覆盖率。</li>
<li><p>
几个用于跳转和操作函数签名的各个部分的功能。这些函数支持匿名函数。
</p>
<ul class="org-ul">
<li>跳转至参数列表， <code>go-goto-arguments (C-c C-f a)</code></li>
<li>跳转至文档字符串，如果尚不存在，请创建该文档字符串， <code>go-goto-docstring(C-c C-f d)</code></li>
<li>跳转到函数关键字， <code>go-goto-function(C-c C-f f)</code></li>
<li>跳转到函数名称,  <code>go-goto-function-name (C-c C-f n)</code></li>
<li>跳转到返回值， = go-goto-return-values (C-c C-f r)=</li>
<li>跳转到方法接收器，如果不存在方法接收器，则添加一对括号， <code>go-goto-method-receiver(C-c C-f m)</code></li>
</ul>

<p>
所有这些函数都接受前缀参数(C-u)，从而使它们跳过匿名函数。
</p></li>

<li><p>
<code>go-guess-gopath</code> 基于 gb 或 wgo 项目，Godeps 和 src 文件夹，为 GOPATH 猜测合适的值。命令 <code>go-set-project</code> 使用 <code>go-guess-gopath</code> 的返回值来设置 GOPATH 环境变量。
</p>

<p>
既可以手动调用 <code>go-set-project</code> ，也可以将其与 Projectile 的项目切换钩子集成，也可以使用其他任何切换项目的方式来使用。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgbbecea5" class="outline-2">
<h2 id="orgbbecea5"><span class="section-number-2">2</span> 安装</h2>
</div>

<div id="outline-container-org94d1c16" class="outline-2">
<h2 id="org94d1c16"><span class="section-number-2">3</span> 配置</h2>
<div class="outline-text-2" id="text-3">
<p>
参见 <a href="https://github.com/phenix3443/emacs.d/blob/master/lisps/golang-ide.el">golang-ide.el</a>
</p>
</div>
</div>

<div id="outline-container-org7dc67c3" class="outline-2">
<h2 id="org7dc67c3"><span class="section-number-2">4</span> 其他扩展</h2>
<div class="outline-text-2" id="text-4">
<p>
有一些第三方扩展可以增强 Emacs 中的 Go 体验。
</p>
</div>

<div id="outline-container-orga855af3" class="outline-3">
<h3 id="orga855af3"><span class="section-number-3">4.1</span> Gopls</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="golang/gopls.html">gopls</a> 是 Go 团队提供的官方语言服务器协议(lsp)实现。它旨在替代现有的第三方工具，用于代码格式化(gofmt)，自动导入(goimport)，代码导航(godef/guru)，类型和功能描述(godoc/godef)，错误检查，自动完成(gocode)，变量和类型重命名(重命名)等。一旦 gopls 稳定后，将不再支持较旧的工具。
</p>

<p>
Gopls 是 lsp-mode 支持的后端。如果在您的 PATH 中找到 gopls，它将由 lsp-mode 自动使用。可以通过以下方式安装
</p>
<div class="org-src-container">
<pre class="src src-sh">go get golang.org/x/tools/gopls@latest
</pre>
</div>
<p>
要为 go 缓冲区启用 lsp 模式：
</p>
<div class="org-src-container">
<pre class="src src-sh">add-hook<span style="color: #ff4ea3;">'go-mode-hook'</span>lsp-deferred)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgae54d69" class="outline-3">
<h3 id="orgae54d69"><span class="section-number-3">4.2</span> 语法/错误检查</h3>
<div class="outline-text-3" id="text-4-2">
<p>
在 Go 中使用 flymake 有两种方法：
</p>
<ul class="org-ul">
<li>goflymake，内部使用 go build 捕获常规编译也会产生的所有错误</li>
<li>flymake-go 是一种仅使用 gofmt 的更轻量级的解决方案，因此只能捕获语法错误。但是，与 goflymake 不同，它不需要其他可执行文件。</li>
</ul>

<p>
此外，还有 flycheck，它是 flymake 的现代替代品，它内置了对 Go 的支持。除了使用 go build 或 gofmt 之外，它还支持 go vet，golint 和 errcheck。
</p>
</div>
</div>

<div id="outline-container-orgd00eec1" class="outline-3">
<h3 id="orgd00eec1"><span class="section-number-3">4.3</span> 自动补全</h3>
<div class="outline-text-3" id="text-4-3">
<p>
使用 company 配合 gopls。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:33</p>
<p class="validation"></p>
</div>
</body>
</html>
